Contact/app/Http/Controllers/PublicController.php

select * from `contacts` where (`nom` like '%ah%' or `prenom` like '%ah%' or `email` like '%ah%') limit 9 offset 0
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select count(*) as aggregate from `contacts` where (`nom` like '%ah%' or `prenom` like '%ah%' or `email` like '%ah%')
---
    public function index(Request $request)
    {
        $query = Contact::with('cities');

        if ($search = $request->get('search')) {
            $query->where(fn($q) => $q
                ->where('nom', 'like', "%{$search}%")
                ->orWhere('prenom', 'like', "%{$search}%")
                ->orWhere('email', 'like', "%{$search}%")
            );
        }

        return view('public.home', ['contacts' => $query->paginate(9)]);