Contact/app/Services/ContactService.php

    public function create(array $data)
    {
        //$data['user_id'] = Auth::id();
        $data['user_id'] = 1; // Default to ID 1 for local dev without auth
        $data = $this->handlePhoto($data);
        $contact = Contact::create($data);
---
insert into `contacts` (`nom`, `prenom`, `email`, `telephone`, `photo`, `user_id`, `updated_at`, `created_at`) values ('aaio', 'jojo', 'ayeg@gmail.com', '90899870', 'contacts/APIqEU3ZQSHgfoltJwJS6WChn4y1zEdLRtuJtZxm.png', 1, '2026-01-23 08:42:04', '2026-01-23 08:42:04')

    public function update(Contact $contact, array $data)
    {
        $data = $this->handlePhoto($data, $contact);
        $contact->update($data);
---
update `contacts` set `prenom` = 'ayoug', `contacts`.`updated_at` = '2026-01-22 11:49:45' where `id` = 19

    public function delete(Contact $contact)
    {
        if ($contact->photo) {
            Storage::disk('public')->delete($contact->photo);
        }
        return $contact->delete();
---
delete from `contacts` where `id` = 12

    public function filterByCity(array $cityIds = [], ?string $searchTerm = null, ?int $perPage = null)
    {
        $query = $this->baseQuery();

        if (!empty($cityIds)) {
            $query->whereHas('cities', fn($q) => $q->whereIn('cities.id', $cityIds));
        }

        if ($searchTerm) {
            $query->where(fn($q) => $q
                ->where('nom', 'like', "%{$searchTerm}%")
                ->orWhere('prenom', 'like', "%{$searchTerm}%")
                ->orWhere('email', 'like', "%{$searchTerm}%")
                ->orWhere('telephone', 'like', "%{$searchTerm}%")
            );
        }

        $query->orderBy('nom');

        return $perPage ? $query->paginate($perPage) : $query->get();
---
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (4, 5, 6, 7, 8, 17, 18, 19)

    private function syncCities(Contact $contact, array $data): void
    {
        if (isset($data['cities'])) {
            $contact->cities()->sync($data['cities']);
---
insert into `city_contact` (`city_id`, `contact_id`) values (6, 22)