Contact/app/Http/Controllers/Admin/ContactController.php

    public function index(Request $request)
    {
        $search = $request->input('search', '');
        $cityFilter = (array) $request->input('cities', []);

        $contacts = ($search || $cityFilter)
            ? $this->contactService->filterByCity($cityFilter, $search)
            : $this->contactService->getAll();

        if ($request->ajax()) {
            return view('admin.contacts.rows', compact('contacts'))->render();
        }

        return view('admin.contacts.index', [
            'contacts' => $contacts,
            'cities' => City::all(),
            'search' => $search,
            'cityFilter' => $cityFilter
        ]);
---
select * from `cities`

    public function store(Request $request)
    {
        $data = $this->validateContact($request);
        $contact = $this->contactService->create($data);

        if ($request->ajax()) {
            $contact->load('cities', 'user');
---
select * from `users` where `users`.`id` in (1)
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (22)

    public function edit(Contact $contact)
    {
        $this->authorizeContact($contact);

        if (request()->wantsJson()) {
            return response()->json($contact->load('cities'));
        }

        return view('admin.contacts.index', [
            'contact' => $contact,
            'cities' => City::all()
        ]);
---
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (19)
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (1)

    public function update(Request $request, Contact $contact)
    {
        $this->authorizeContact($contact);
        $data = $this->validateContact($request);
        $this->contactService->update($contact, $data);

        if ($request->ajax()) {
            $contact->refresh()->load('cities', 'user');
---
select * from `users` where `users`.`id` in (1)
select `cities`.*, `city_contact`.`contact_id` as `pivot_contact_id`, `city_contact`.`city_id` as `pivot_city_id` from `cities` inner join `city_contact` on `cities`.`id` = `city_contact`.`city_id` where `city_contact`.`contact_id` in (19)