Contact/app/Http/Controllers/Admin/DashboardController.php

    public function index(\Illuminate\Http\Request $request)
    {
        $search = $request->input('search');

        // If searching, use the filter service. Otherwise, get recent 5.
        // Note: The user might want *all* contacts if they are scrolling/paginating,
        // but for now let's stick to: Search -> Found results; No Search -> Recent 5.

        if ($search) {
            $contacts = $this->contactService->filterByCity([], $search);
        } else {
            // Replicate the 'recent' logic but we need it as a collection for the view
            $contactQuery = Auth::user()->role === 'admin'
                ? Contact::query()
                : Contact::where('user_id', Auth::id());

            $contacts = $contactQuery->with('cities', 'user')->latest()->limit(5)->get();
        }

        if ($request->ajax()) {
            return view('admin.contacts.rows', compact('contacts'))->render();
        }

        // Stats logic (keep existing stats)
        $totalQuery = Auth::user()->role === 'admin' ? Contact::query() : Contact::where('user_id', Auth::id());
        $stats = [
            'total_contacts' => $totalQuery->count(),
            'total_cities' => City::count(),
        ];

        return view('admin.dashboard', [
            'stats' => $stats,
            'contacts' => $contacts,
            'cities' => City::all(),
            'search' => $search
        ]);
---
select * from `contacts` order by `created_at` desc limit 5
select * from `users` where `users`.`id` in (1)
select * from `cities`